// entities/review/model/mock.ts
import type { Review } from '@/entities/review/model/types'
// import ReviewUser from '@/entities/review/assets/images/review-user.jpg'
// import PlaceImage from '@/pages/route/assets/images/place-slider-img.jpg'

export const mockReviewsData: Review[] = [
    {
        userId: 21,
        nickName: "michael92",
        description: "Тропа неожиданно затянула. Обычно гуляю без плана и быстро теряю интерес, а тут маршрут сам ведёт и не даёт заскучать. Появилось ощущение, что город не просто фон, а участник прогулки. Нашёл пару мест, мимо которых раньше проходил и даже не замечал. Тропа выручает, когда хочется выйти из дома, но идей ноль. Маршруты не туристические и без пафоса. Всё спокойно, по делу и с ощущением, что тебя ведут, а не грузят списком «обязательных мест».",
        userImage: null,
    },
    {
        userId: 22,
        nickName: "annaVela",
        description: "Скачал Тропу из любопытства и не ожидал, что она так зайдёт. Просто выбираешь маршрут и идёшь — без планирования и суеты. Открыл для себя места, мимо которых раньше проходил сотню раз. Гуляю чаще и с удовольствием.",
        userImage: null,
    },
    {
        userId: 23,
        nickName: "harper28",
        description: "Скачал Тропу из любопытства и не ожидал, что она так зайдёт. Просто выбираешь маршрут и идёшь — без планирования и суеты. Открыл для себя места, мимо которых раньше проходил сотню раз. Гуляю чаще и с удовольствием.",
        userImage: null,
    },
    {
        userId: 5,
        nickName: "andreymacn@gmail.com",
        description: "Скачал Тропу из любопытства и не ожидал, что она так зайдёт. Просто выбираешь маршрут и идёшь — без планирования и суеты. Открыл для себя места, мимо которых раньше проходил сотню раз. Гуляю чаще и с удовольствием.",
        userImage: null,
    },
    {
        userId: 3,
        nickName: "andzuev74@gmail.com",
        description: "Тропа неожиданно затянула. Обычно гуляю без плана и быстро теряю интерес, а тут маршрут сам ведёт и не даёт заскучать. Появилось ощущение, что город не просто фон, а участник прогулки. Нашёл пару мест, мимо которых раньше проходил и даже не замечал. Тропа выручает, когда хочется выйти из дома, но идей ноль. Маршруты не туристические и без пафоса. Всё спокойно, по делу и с ощущением, что тебя ведут, а не грузят списком «обязательных мест».",
        userImage: null,
    }
];
